levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/inc/hc32m423_icg.h
/**
 *******************************************************************************
 * @defgroup ICG_LVD_Hardware_Start_Configuration LVD Hardware Start Configuration
 * @{
 *******************************************************************************
 */
/* Enable or disable LVD hardware start */
#define ICG1_LVD_HARDWARE_START                 (ICG_FUNCTION_OFF)

/* Lockup register config */
#define ICG1_LKUP_DIS                           (ICG_LOCKUP_RESET_ENABLE)
/* LVD register config */
#define ICG1_LVD0_LVL                           (ICG_LVD_BELOW2P82_OR_ABOVE2P90)
#define ICG1_LVD0_DIS                           (ICG_LVD_VOLTAGE_DETECTION_ENABLE)

/* LVD register config value */
#if ICG1_LVD_HARDWARE_START == ICG_FUNCTION_ON
    #define ICG1_LVD_REG_CONFIG                 ((uint32_t)(ICG1_LKUP_DIS | ICG1_LVD0_LVL | ICG1_LVD0_DIS))
#else
    #define ICG1_LVD_REG_CONFIG                 ((uint32_t)0xFFFFFFFFUL)
#endif

/**
 * @}
 */

/**
 *******************************************************************************
 * @defgroup ICG_WDT_Hardware_Start_Configuration WDT Hardware Start Configuration
 * @{
 *******************************************************************************
 */
/* Enable or disable WDT hardware start */
#define ICG7_WDT_HARDWARE_START                 (ICG_FUNCTION_OFF)

/* WDT register config */
#define ICG7_WDT_AUTST                          (ICG_WDT_AFTER_RESET_AUTOSTART)
#define ICG7_WDT_ITS                            (ICG_WDT_TRIG_EVENT_INT)
#define ICG7_WDT_PERI                           (ICG_WDT_COUNTER_CYCLE_4096)
#define ICG7_WDT_CKS                            (ICG_WDT_CLOCK_DIV256)
#define ICG7_WDT_WDPT                           (ICG_WDT_RANGE_100PCT)
#define ICG7_WDT_SLTPOFF                        (ICG_WDT_LPW_MODE_COUNT_CONTINUE)

/* WDT register config value */
#if ICG7_WDT_HARDWARE_START == ICG_FUNCTION_ON
    #define ICG7_WDT_REG_CONFIG                 (((uint32_t)ICG7_WDT_AUTST | ICG7_WDT_ITS | \
                                                            ICG7_WDT_PERI  | ICG7_WDT_CKS | \
                                                            ICG7_WDT_WDPT  | ICG7_WDT_SLTPOFF))
#else
    #define ICG7_WDT_REG_CONFIG                 ((uint32_t)0xFFFFFFFFUL)
#endif

/**
 * @}
 */

/**
 *******************************************************************************
 * @defgroup ICG_Registers_Configuration ICG Registers Configuration
 * @{
 *******************************************************************************
 */
/* ICG0 register value */
#define ICG0_REGISTER_CONSTANT                  ((uint32_t)(ICG0_SWDT_REG_CONFIG | \
                                                            ICG0_HRC_REG_CONFIG  | \
                                                            ICG0_NMI_REG_CONFIG))
/* ICG1 register value */
#define ICG1_REGISTER_CONSTANT                  ((uint32_t)ICG1_LVD_REG_CONFIG)
/* ICG2~6 register reserved value */
#define ICG2_REGISTER_CONSTANT                  ((uint32_t)0xFFFFFFFFUL)
#define ICG3_REGISTER_CONSTANT                  ((uint32_t)0xFFFFFFFFUL)
#define ICG4_REGISTER_CONSTANT                  ((uint32_t)0xFFFFFFFFUL)
#define ICG5_REGISTER_CONSTANT                  ((uint32_t)0xFFFFFFFFUL)
#define ICG6_REGISTER_CONSTANT                  ((uint32_t)0xFFFFFFFFUL)
/* ICG7 register value */
#define ICG7_REGISTER_CONSTANT                  ((uint32_t)ICG7_WDT_REG_CONFIG)

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/

#endif /* DDL_ICG_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32M423_ICG_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
